sum_even = 0  # ყველა ლუწი რიცხვის ჯამის ინიციალიზაცია
count_even = 0  # ლუწი რიცხვების რაოდენობის ინიციალიზაცია
number = 1  # საწყისი რიცხვი

while number <= 100:  # სანამ რიცხვი 100-ზე ნაკლები ან ტოლია
    if number % 2 == 0:  # თუ რიცხვი ლუწია
        sum_even += number  # დავუმატოთ ჯამს ეს რიცხვი
        count_even += 1  # ლუწი რიცხვების რაოდენობას +1
    number += 1  # გადავიდეთ შემდეგ რიცხვზე

average = sum_even / count_even  # საშუალო არითმეტიკული: ჯამი / რაოდენობა
print("1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული არის:", average)
