# string(ტექსტური ტიპის მონაცემი) არის ნებისმიერი ტექსტი, რომელიც იწერება ბრჭყალებში
# მაგალითად: "Vashli", "5", "10.2"...

# integer(მთელი რიცხვი) მთელი მათემატიკური რიცხვი ბრჭყალების და წერტილი გარეშე
# მაგალითად: 5, 10, 237...

# float(ათწილადი რიცხვი) ათწილადი მათემატიკური რიცხვი ბრჭყალების გარეშე
# მაგალითად: 2.1 ; 5.0 ; 10.2...

age1 = 20
age2 = 30

result1 = age1 + 20
result2 = age2 + 20

print(result1)
print(result2)

name = "Mariam"
age = 15
float_num = 20.5

print(name)
print(age)
print(float_num)